src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Получает Структуру предопределенных групп Номенклатуры.\
// [прим разработчика]: Не используется в текущей реализации
//
// Возвращаемое значение:
//  Структура
Функция ПолучитьГруппыНоменклатуры() Экспорт
    группы = Новый Структура;

    группы.Вставить("Материалы",
        Новый Структура("Группа, ТипНоменклатуры", Материалы, Перечисления.ТипыНоменклатуры.Материал));
    группы.Вставить("Товары",
        Новый Структура("Группа, ТипНоменклатуры", Товары, Перечисления.ТипыНоменклатуры.Товар));
    группы.Вставить("Услуги",
        Новый Структура("Группа, ТипНоменклатуры", Услуги, Перечисления.ТипыНоменклатуры.Услуга));

    Возврат группы;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
